In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plot

# 加载数据

In [19]:
# 加载数据
col_name = ["乘客id", "存活", "舱位等级", "姓名", "性别", "年龄", "兄弟姐妹个数", "父母子女个数", "船票信息", "票价", "客舱", "登船港口"]
train_data = pd.read_csv("./data/train.csv", names = col_name, index_col='乘客id', header=0)

# 分割数据
train_data_x = train_data.drop(columns=['存活'])
train_data_y = train_data[['存活']]

In [20]:
# 查看前10行
train_data_x.head(10)

,舱位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,客舱,登船港口
乘客id,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [21]:
# 查看label的前10行
train_data_y.head(10)

      存活
乘客id
1      0
2      1
3      1
4      1
5      0
6      0
7      0
8      0
9      1
10     1

# 数据探索

In [23]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   存活      891 non-null    int64
 1   舱位等级    891 non-null    int64
 2   姓名      891 non-null    object
 3   性别      891 non-null    object
 4   年龄      714 non-null    float64
 5   兄弟姐妹个数  891 non-null    int64
 6   父母子女个数  891 non-null    int64
 7   船票信息    891 non-null    object
 8   票价      891 non-null    float64
 9   客舱      204 non-null    object
 10  登船港口    889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [24]:
train_data.describe()

               存活        舱位等级          年龄      兄弟姐妹个数      父母子女个数          票价
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [27]:
# 查看幸存者的总体描述
train_data[train_data["存活"] == 1].describe()

          存活        舱位等级          年龄      兄弟姐妹个数      父母子女个数          票价
count  342.0  342.000000  290.000000  342.000000  342.000000  342.000000
mean     1.0    1.950292   28.343690    0.473684    0.464912   48.395408
std      0.0    0.863321   14.950952    0.708688    0.771712   66.596998
min      1.0    1.000000    0.420000    0.000000    0.000000    0.000000
25%      1.0    1.000000   19.000000    0.000000    0.000000   12.475000
50%      1.0    2.000000   28.000000    0.000000    0.000000   26.000000
75%      1.0    3.000000   36.000000    1.000000    1.000000   57.000000
max      1.0    3.000000   80.000000    4.000000    5.000000  512.329200

In [28]:
# 查看非幸存者的总体描述
train_data[train_data["存活"] == 0].describe()

          存活        舱位等级          年龄      兄弟姐妹个数      父母子女个数          票价
count  549.0  549.000000  424.000000  549.000000  549.000000  549.000000
mean     0.0    2.531876   30.626179    0.553734    0.329690   22.117887
std      0.0    0.735805   14.172110    1.288399    0.823166   31.388207
min      0.0    1.000000    1.000000    0.000000    0.000000    0.000000
25%      0.0    2.000000   21.000000    0.000000    0.000000    7.854200
50%      0.0    3.000000   28.000000    0.000000    0.000000   10.500000
75%      0.0    3.000000   39.000000    1.000000    0.000000   26.000000
max      0.0    3.000000   74.000000    8.000000    6.000000  263.000000

# 数据清洗

In [29]:
# 缺失值情况
train_data.isnull().sum()

存活          0
舱位等级        0
姓名          0
性别          0
年龄        177
兄弟姐妹个数      0
父母子女个数      0
船票信息        0
票价          0
客舱        687
登船港口        2
dtype: int64

In [32]:
# 以均值替换年龄
train_data.fillna(train_data['年龄'].mean(), inplace=True)

train_data

,存活,舱位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,客舱,登船港口
乘客id,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,29.699118,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,29.699118,S
...,...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,29.699118,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S
890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,29.699118,Q

In [33]:
# 删除客舱列

train_data.drop(columns=['客舱'], inplace=True)

train_data

,存活,舱位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,登船港口
乘客id,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C
3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,S
5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,S
890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C
891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,Q

In [34]:
# 删除登船港口缺失的行

train_data.dropna(axis=0, subset=['登船港口'], inplace=True)

train_data

,存活,舱位等级,姓名,性别,年龄,兄弟姐妹个数,父母子女个数,船票信息,票价,登船港口
乘客id,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C
3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,S
5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,S
888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,S
889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,S
890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C
891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,Q

In [35]:
train_data.isnull().sum()

存活        0
舱位等级      0
姓名        0
性别        0
年龄        0
兄弟姐妹个数    0
父母子女个数    0
船票信息      0
票价        0
登船港口      0
dtype: int64

In [37]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, 1 to 891
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   存活      891 non-null    int64
 1   舱位等级    891 non-null    int64
 2   姓名      891 non-null    object
 3   性别      891 non-null    object
 4   年龄      891 non-null    float64
 5   兄弟姐妹个数  891 non-null    int64
 6   父母子女个数  891 non-null    int64
 7   船票信息    891 non-null    object
 8   票价      891 non-null    float64
 9   登船港口    891 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 76.6+ KB